import "./post.css";

export default function Post() {
  return (
    <>
      <div className="post">
        <img className="postImg" src="https://reactjs.org/logo-og.png" alt="" />
        <div className="postInfo">
          <div className="postCats">
            <span className="postCat">Life</span>
            <span className="postCat">Music</span>
          </div>
          <span className="postTitle">
            글 제목제목제목메고제ㅓ레저레ㅓ아니ㅓ라ㅣㄴ어라ㅣㅓ
          </span>
          <hr />
          <span className="postData">1 hour ago</span>
        </div>
        <p className="postDesc">
          모든 국민은 직업선택의 자유를 가진다. 사회적 특수계급의 제도는
          인정되지 아니하며, 어떠한 형태로도 이를 창설할 수 없다. 제3항의 승인을
          얻지 못한 때에는 그 처분 또는 명령은 그때부터 효력을 상실한다. 이 경우
          그 명령에 의하여 개정 또는 폐지되었던 법률은 그 명령이 승인을 얻지
          못한 때부터 당연히 효력을 회복한다. 헌법재판소 재판관의 임기는 6년으로
          하며, 법률이 정하는 바에 의하여 연임할 수 있다. 군인 또는 군무원이
          아닌 국민은 대한민국의 영역안에서는 중대한 군사상
          기밀·초병·초소·유독음식물공급·포로·군용물에 관한 죄중 법률이 정한
          경우와 비상계엄이 선포된 경우를 제외하고는 군사법원의 재판을 받지
          아니한다. 모든 국민은 직업선택의 자유를 가진다. 사회적 특수계급의
          제도는 인정되지 아니하며, 어떠한 형태로도 이를 창설할 수 없다. 제3항의
          승인을 얻지 못한 때에는 그 처분 또는 명령은 그때부터 효력을 상실한다.
          이 경우 그 명령에 의하여 개정 또는 폐지되었던 법률은 그 명령이 승인을
          얻지 못한 때부터 당연히 효력을 회복한다. 헌법재판소 재판관의 임기는
          6년으로 하며, 법률이 정하는 바에 의하여 연임할 수 있다. 군인 또는
          군무원이 아닌 국민은 대한민국의 영역안에서는 중대한 군사상
          기밀·초병·초소·유독음식물공급·포로·군용물에 관한 죄중 법률이 정한
          경우와 비상계엄이 선포된 경우를 제외하고는 군사법원의 재판을 받지
          아니한다. 모든 국민은 직업선택의 자유를 가진다. 사회적 특수계급의
          제도는 인정되지 아니하며, 어떠한 형태로도 이를 창설할 수 없다. 제3항의
          승인을 얻지 못한 때에는 그 처분 또는 명령은 그때부터 효력을 상실한다.
          이 경우 그 명령에 의하여 개정 또는 폐지되었던 법률은 그 명령이 승인을
          얻지 못한 때부터 당연히 효력을 회복한다. 헌법재판소 재판관의 임기는
          6년으로 하며, 법률이 정하는 바에 의하여 연임할 수 있다. 군인 또는
          군무원이 아닌 국민은 대한민국의 영역안에서는 중대한 군사상
          기밀·초병·초소·유독음식물공급·포로·군용물에 관한 죄중 법률이 정한
          경우와 비상계엄이 선포된 경우를 제외하고는 군사법원의 재판을 받지
          아니한다. 모든 국민은 직업선택의 자유를 가진다. 사회적 특수계급의
          제도는 인정되지 아니하며, 어떠한 형태로도 이를 창설할 수 없다. 제3항의
          승인을 얻지 못한 때에는 그 처분 또는 명령은 그때부터 효력을 상실한다.
          이 경우 그 명령에 의하여 개정 또는 폐지되었던 법률은 그 명령이 승인을
          얻지 못한 때부터 당연히 효력을 회복한다. 헌법재판소 재판관의 임기는
          6년으로 하며, 법률이 정하는 바에 의하여 연임할 수 있다. 군인 또는
          군무원이 아닌 국민은 대한민국의 영역안에서는 중대한 군사상
          기밀·초병·초소·유독음식물공급·포로·군용물에 관한 죄중 법률이 정한
          경우와 비상계엄이 선포된 경우를 제외하고는 군사법원의 재판을 받지
          아니한다. 모든 국민은 직업선택의 자유를 가진다. 사회적 특수계급의
          제도는 인정되지 아니하며, 어떠한 형태로도 이를 창설할 수 없다. 제3항의
          승인을 얻지 못한 때에는 그 처분 또는 명령은 그때부터 효력을 상실한다.
          이 경우 그 명령에 의하여 개정 또는 폐지되었던 법률은 그 명령이 승인을
          얻지 못한 때부터 당연히 효력을 회복한다. 헌법재판소 재판관의 임기는
          6년으로 하며, 법률이 정하는 바에 의하여 연임할 수 있다. 군인 또는
          군무원이 아닌 국민은 대한민국의 영역안에서는 중대한 군사상
          기밀·초병·초소·유독음식물공급·포로·군용물에 관한 죄중 법률이 정한
          경우와 비상계엄이 선포된 경우를 제외하고는 군사법원의 재판을 받지
          아니한다.
        </p>
      </div>
    </>
  );
}
